#include <iostream>
#include <fstream>
#include <stdarg.h>
#include <cassert>
#include <vector>
#include <bitset>

#define LOG(fmt, ...) reader::log(__LINE__, fmt, __VA_ARGS__)
#define ASSERT(con, fmt, ...) do {\
                                if(!con)\
                                    LOG(fmt, __VA_ARGS__);\
                                    assert(con);\
                            }\
                         while(false);\

#define NOTSET -1

//#define ASSERT(con) assert(con)

namespace reader
{
    typedef unsigned char byte_t;
    //typedef char byte_t;

    // valid call log("float %0.2f", 1.0)
    // formats must match vararg types
    void log(int lineNumber, const char* fmt, ...)
    {
        char buffer[1000]{};
        va_list vararglist;
        va_start(vararglist, fmt);
        vprintf(fmt, vararglist);
        va_end(vararglist);
        printf(" at line [%i]\n", lineNumber);
    }

    std::string toHex(const char byte)
    {
        static constexpr char HEXITS[] = "0123456789ABCDEF";
        std::string str(4, '\0');
        auto k = str.begin();
        *k++ = '0';
        *k++ = 'x';
        *k++ = HEXITS[byte >> 4];
        *k++ = HEXITS[byte & 0x0F];
        return str;
    }

    std::vector<std::string> toHexVector(const std::vector<byte_t>& bytes)
    {
        std::vector<std::string> hex(bytes.size());
        for (auto byte_t : bytes)
        {
            hex.push_back(toHex(byte_t));
        }
        return hex;
    }

    std::string toHexString(const std::vector<byte_t>& bytes, const char delimiter = ' ')
    {
        static constexpr char HEXITS[] = "0123456789ABCDEF";

        std::string str(5 * bytes.size(), '\0');
        auto k = str.begin();

        for (auto c : bytes) {
            *k++ = '0';
            *k++ = 'x';
            *k++ = HEXITS[c >> 4];
            *k++ = HEXITS[c & 0x0F];
            *k++ = delimiter;
        }
        return str;
    }

    std::vector<byte_t> pad(const std::vector<byte_t>& bytes, int64_t bytesToAdd)
    {
        std::vector<byte_t> result = bytes;
        if (bytesToAdd <= 0) return result;

        for (int64_t i = 0; i < bytesToAdd; i++)
        {
            result.push_back(0);
        }
        return result;
    }

    template<typename T = int>
    T toT_l(const std::vector<byte_t>& b)
    {
        auto bytes = pad(b, sizeof(T) - b.size());
        ASSERT((sizeof(T) == bytes.size()), "[ERROR] toT_l T not [%i].", sizeof(T));
        if constexpr (sizeof(T) == 1)
        {
            //static_assert(sizeof(T) == 1);
            return static_cast<T>
                (
                    static_cast<T>(bytes[0])
                );
        }
        else if constexpr (sizeof(T) == 2)
        {
            //static_assert(sizeof(T) == 2);
            return static_cast<T>
                (
                    static_cast<T>(bytes[1]) << 8 |
                    static_cast<T>(bytes[0])
                );
        }
        else if constexpr (sizeof(T) == 3)
        {
            //static_assert(sizeof(T) == 3);
            return static_cast<T>
                (
                    static_cast<T>(bytes[2]) << 16 |
                    static_cast<T>(bytes[1]) << 8 |
                    static_cast<T>(bytes[0])
                );
        }
        else if constexpr (sizeof(T) == 4)
        {
            //static_assert(sizeof(T) == 4);
            return static_cast<T>
                (
                    static_cast<T>(bytes[3]) << 24 |
                    static_cast<T>(bytes[2]) << 16 |
                    static_cast<T>(bytes[1]) << 8 |
                    static_cast<T>(bytes[0])
                );
        }
        else if constexpr (sizeof(T) == 8)
        {
            static_assert(sizeof(T) == 8);
            return static_cast<T>
                (
                    static_cast<T>(bytes[7]) << 56 |
                    static_cast<T>(bytes[6]) << 48 |
                    static_cast<T>(bytes[5]) << 40 |
                    static_cast<T>(bytes[4]) << 32 |
                    static_cast<T>(bytes[3]) << 24 |
                    static_cast<T>(bytes[2]) << 16 |
                    static_cast<T>(bytes[1]) << 8  |
                    static_cast<T>(bytes[0])
                );
        }
        ASSERT(false, "[ERROR] [bytes] &s vector can only be of size 2 to 4.", toHexString(bytes).c_str());
        return -1;
    }

    //std::uint64_t toUInt_64b(const std::vector<byte_t>& bytes)
    //{
    //    ASSERT((bytes.size() == 8), "[ERROR] toInt64 bytes buffer must be of size 8 [not] %i.", bytes.size());
    //    return  (((std::uint64_t)((std::uint8_t*)bytes[7])) << 0) +
    //        (((std::uint64_t)((std::uint8_t*)bytes[6])) << 8) +
    //        (((std::uint64_t)((std::uint8_t*)bytes[5])) << 16) +
    //        (((std::uint64_t)((std::uint8_t*)bytes[4])) << 24) +
    //        (((std::uint64_t)((std::uint8_t*)bytes[3])) << 32) +
    //        (((std::uint64_t)((std::uint8_t*)bytes[2])) << 40) +
    //        (((std::uint64_t)((std::uint8_t*)bytes[1])) << 48) +
    //        (((std::uint64_t)((std::uint8_t*)bytes[0])) << 56);
    //}
    //template<typename T>
    //T toT_l(const std::vector<byte_t>& byte)
    //{
    //    ASSERT((byte.size() == 1), "[ERROR] toT_l bytes buffer must be of size 8 not [%i].", byte.size());
    //    ASSERT((sizeof(T) == 1), "[ERROR] toT_l T not [%i].", sizeof(T));
    //    return  (T) byte[0];
    //}

    // For Windows
    std::uint64_t toUInt_64l(const std::vector<byte_t>& bytes)
    {
        ASSERT((bytes.size() == 8), "[ERROR] toInt64 bytes buffer must be of size 8 [not] %i.", bytes.size());
        return  (((std::uint64_t) ( (std::uint8_t*) bytes[0]) ) << 0)  +
                (((std::uint64_t) ( (std::uint8_t*) bytes[1]) ) << 8)  +
                (((std::uint64_t) ( (std::uint8_t*) bytes[2]) ) << 16) +
                (((std::uint64_t) ( (std::uint8_t*) bytes[3]) ) << 24) +
                (((std::uint64_t) ( (std::uint8_t*) bytes[4]) ) << 32) +
                (((std::uint64_t) ( (std::uint8_t*) bytes[5]) ) << 40) +
                (((std::uint64_t) ( (std::uint8_t*) bytes[6]) ) << 48) +
                (((std::uint64_t) ( (std::uint8_t*) bytes[7]) ) << 56);
    }

    template<std::size_t BITS>
    std::bitset<BITS> bytesToBits(const std::vector<byte_t>& bytes)
    {
